{
  "data": {
    "category": [
      "JavaScript",
      "React",
      "React Native"
    ],
    "created": "01-12-2021",
    "id": 1,
    "image": "test.png",
    "lastUpdated": "02-12-2021",
    "title": "Implementing a WhatsApp like Swipe to Delete Feature in React Native",
    "toc": [
      {
        "title": "Goal",
        "id": "goal"
      },
      {
        "title": "Objectives",
        "id": "objectives"
      },
      {
        "title": "Implementation",
        "id": "implementation"
      },
      {
        "title": "Animations",
        "id": "animations"
      },
      {
        "title": "Final Touch",
        "id": "final-touch"
      },
      {
        "title": "Considerations & Limitations",
        "id": "considerations/limitations"
      }
    ],
    "type": "post"
  },
  "slug": "post-1",
  "source": {
    "compiledSource": "var d=Object.defineProperty,c=Object.defineProperties;var m=Object.getOwnPropertyDescriptors;var n=Object.getOwnPropertySymbols;var r=Object.prototype.hasOwnProperty,s=Object.prototype.propertyIsEnumerable;var h=(e,t,a)=>t in e?d(e,t,{enumerable:!0,configurable:!0,writable:!0,value:a}):e[t]=a,o=(e,t)=>{for(var a in t||(t={}))r.call(t,a)&&h(e,a,t[a]);if(n)for(var a of n(t))s.call(t,a)&&h(e,a,t[a]);return e},p=(e,t)=>c(e,m(t));var l=(e,t)=>{var a={};for(var i in e)r.call(e,i)&&t.indexOf(i)<0&&(a[i]=e[i]);if(e!=null&&n)for(var i of n(e))t.indexOf(i)<0&&s.call(e,i)&&(a[i]=e[i]);return a};const makeShortcode=e=>function(a){return console.warn(\"Component \"+e+\" was not imported, exported, or provided by MDXProvider as global scope\"),mdx(\"div\",o({},a))},SwipeListView=makeShortcode(\"SwipeListView\"),VisibleItem=makeShortcode(\"VisibleItem\"),HiddenItemWithActions=makeShortcode(\"HiddenItemWithActions\"),FlatList=makeShortcode(\"FlatList\"),layoutProps={},MDXLayout=\"wrapper\";function MDXContent(a){var i=a,{components:e}=i,t=l(i,[\"components\"]);return mdx(MDXLayout,p(o(o({},layoutProps),t),{components:e,mdxType:\"MDXLayout\"}),mdx(\"p\",null,mdx(\"img\",o({parentName:\"p\"},{src:\"https://cdn-images-1.medium.com/max/1600/1*cVvWIFk7sN3x0YwnFki7Iw.gif\",alt:\"Demo image\"}))),mdx(\"p\",null,\"Swipe to delete has become a very common feature present in most mobile apps today. If done correctly, it feels like all's right with the world. If not, it can turn into a nightmarish experience for the user resulting in countless recipes and playlist songs unexpectedly disappearing into the ether.\"),mdx(\"h3\",null,\"Goal\",mdx(\"a\",{name:\"goal\"})),mdx(\"p\",null,\"In this post we'll explore how we can create a smooth, responsive and intuitive swipe to delete in React Native and what challenges and limitations we might face. I am a big fan of the WhatsApp implementation so we'll aim for a similar look and feel.\"),mdx(\"h3\",null,\"Objectives\",mdx(\"a\",{name:\"objectives\"})),mdx(\"p\",null,\"In order to deliver on our promise, here's some of the criteria our design needs to meet.\"),mdx(\"ul\",null,mdx(\"li\",{parentName:\"ul\"},\"Provide visual and sensory cues to signal to users what action is taking place and what the consequences of following through on that action will be\"),mdx(\"li\",{parentName:\"ul\"},\"Allow users to change their mind mid swipe and cancel the action\"),mdx(\"li\",{parentName:\"ul\"},\"Provide feedback after a swipe has been completed\"),mdx(\"li\",{parentName:\"ul\"},\"Achieve smooth and seamless transitions and animations to deliver a great user experience\")),mdx(\"p\",null,\"Here is what our end product will look like:\"),mdx(\"p\",null,\"// Figure out way to embed youtube video\"),mdx(\"h3\",null,\"Implementation\",mdx(\"a\",{name:\"implementation\"})),mdx(\"p\",null,`We'll be using a third-party library called react-native-swipe-list-view which gives us a Swipe List component in conjunction with React Native's Animated API for more granular control over our animations.\nYou can find the complete example on Github.\nIf you prefer a longer video format check out this video:`),mdx(\"p\",null,\"Let's create a new React Native project and install the library.\"),mdx(\"pre\",null,mdx(\"code\",o({parentName:\"pre\"},{}),`npx react-native init swipeToDelete\ncd swipeToDelete\nnpx react-native run-ios\nnpm i react-native-swipe-list-view\nnpx pod-install\n`)),mdx(\"p\",null,\"We'll import out \",mdx(SwipeListView,{mdxType:\"SwipeListView\"}),\" component and generate some dummy list data to pass to the data prop. The view also requires a renderItem and renderHiddenItem props to render a front row and a hidden row which is revealed when the user swipes and contains our action buttons. We'll pass a function to each prop which accepts 2 parameters\\u200A-\\u200ArowData and rowMap and returns a React element. rowData as the name suggests is the extracted data for an individual row from the data array we passed earlier where as rowMap is an object that looks like this\"),mdx(\"pre\",null,mdx(\"code\",o({parentName:\"pre\"},{}),`{\nrow_key_1: ref_to_row_1,\nrow_key_2: ref_to_row_2\n}\n`)),mdx(\"p\",null,\"and contains a reference to the row which can be used to access helpful methods like closeRow to swipe a row closed programatically. The row key is the same key we are passing through our data array or if one is not defined, it will use the key generated by the keyExtractor prop.\"),mdx(\"p\",null,\"// Embed code snippet\"),mdx(\"p\",null,`We are also adding the disableRightSwipe prop to disable swiping from left to right for simplicity sake and setting the rightOpenValue prop to -120 which is the translate value for the front row along the x-axis when the row is opened. The value will always be negative since we want to shift the front row to the left to reveal the hidden row on the right side.\nNext, we'll add the `,mdx(VisibleItem,{mdxType:\"VisibleItem\"}),\" and \",mdx(HiddenItemWithActions,{mdxType:\"HiddenItemWithActions\"}),` components which are returned from the renderItem and renderHiddenItem functions. They are responsible for rendering the content of the front and back row. They can also react to changes in the swipe state and show that some action has been activated, e.g. expand the delete button to full width of the row. To enable this behaviour we also need to set some props to configure these actions.\nWe'll need some icons too.`),mdx(\"pre\",null,mdx(\"code\",o({parentName:\"pre\"},{}),`npm i react-native-svg\nnpx pod-install\nnpm i react-native-eva-icons\n`)),mdx(\"p\",null,\"// Embed code snippet\"),mdx(\"p\",null,`We are utilising the rightActivationValue prop as an indicator to signify to the user that an important action is able to take place should they decide to proceed. Once the swipe value exceeds the rightActivationValue it will fire off the onRightActionStatusChange function and activate the rightActionActivated value which is another prop we can pass to the hidden row component and make use of to animate the delete button expanding to the full width of the row or contacting to its initial width if the action is cancelled.\nThe swipeGestureEnded prop takes a function which is called when the user has ended their swipe gesture and can be used to animate the row being deleted and to provide confirmation of the successful completion of the action. The rightActionValue is the translateX value to which the row will be shifted after the gesture is released which in our case is the whole width of the screen so that the front row disappears completely. The swipeToOpenPercent / swipeToClosePercent props are the percentage of the rightOpenValue the user needs to swipe past to trigger the row opening / closing.\nWe are also setting the useNativeDriver prop to false because we'll be animating layout properties that are not supported by the native driver such as the height and width of the row.`),mdx(\"h3\",null,\"Animations\",mdx(\"a\",{name:\"animations\"})),mdx(\"p\",null,\"In order to animate the rows and buttons we need to do a refactor of the visible and hidden component and wrap some of the content with animatable components. We'll create a list to store the animated values for the row height and the delete button width for all rows. We'll also want to animate the translateX property of the buttons to create a smooth in and out of view transition. For that purpose we can make use of another prop passed to the hidden component called swipeAnimatedValue which gives us direct access to the swipe row translateX animated value. We can interpolate that value to get the transition just the way we want it.\"),mdx(\"p\",null,\"// Embed code snippet\"),mdx(\"p\",null,\"When the swipe gesture is released if the translateX swipe value exceeds the rightActivationValue (< -200) the row will be shifted to our rightActionValue and disappear from the viewport. We'll also use the Animated.timing() API to animate the width of the delete button to fill the screen width and the row height to 0. We'll pass a callback function to the timing method which will remove the respective item from the list immediately after the animation runs making the whole row disappear completely.\"),mdx(\"h3\",null,\"Final Touch\",mdx(\"a\",{name:\"final-touch\"})),mdx(\"p\",null,\"For the cherry on top, we'll provide some haptic feedback the moment the user swipes past the activation value to drive home the message that something important is taking place.\"),mdx(\"pre\",null,mdx(\"code\",o({parentName:\"pre\"},{}),`npm i react-native-haptic-feedback\nnpx pod-install\n`)),mdx(\"p\",null,\"// Embed code snippet\"),mdx(\"h3\",null,\"Considerations / Limitations\",mdx(\"a\",{name:\"considerations/limitations\"})),mdx(\"p\",null,`While this swipe list works like a charm with small lists, it doesn't fare especially well with big ones. Here are some tips to work around this limitation:\nMake sure to optimise your `,mdx(FlatList,{mdxType:\"FlatList\"}),\" which is what \",mdx(SwipeListView,{mdxType:\"SwipeListView\"}),` uses under the hood.\nDesign animations to use only non-layout properties like transform and opacity which are supported by the native driver. In our example, we could have animated the scaleY property of the row instead of the height to have it disappear.\nreact-native-swipe-list-view uses React Native's Animated library and the creator has no intention of migrating to Reanimated. Find an alternative swipe list package based on Reanimated in order to offload animation and event handling logic off of the JavaScript thread and onto the UI thread.`),mdx(\"p\",null,\"Hope you enjoyed the read\\xA0:)\"))}MDXContent.isMDXComponent=!0;\n",
    "scope": {
      "category": [
        "JavaScript",
        "React",
        "React Native"
      ],
      "created": "01-12-2021",
      "id": 1,
      "image": "test.png",
      "lastUpdated": "02-12-2021",
      "title": "Implementing a WhatsApp like Swipe to Delete Feature in React Native",
      "toc": [
        {
          "title": "Goal",
          "id": "goal"
        },
        {
          "title": "Objectives",
          "id": "objectives"
        },
        {
          "title": "Implementation",
          "id": "implementation"
        },
        {
          "title": "Animations",
          "id": "animations"
        },
        {
          "title": "Final Touch",
          "id": "final-touch"
        },
        {
          "title": "Considerations & Limitations",
          "id": "considerations/limitations"
        }
      ],
      "type": "post"
    }
  }
}